tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
Nucleo_F207ZG.menu.log.default=Release(no-exceptions)
Nucleo_F207ZG.menu.log.default.build.log_level=-fno-exceptions
Nucleo_F207ZG.menu.log.Release=Release(exceptions)
Nucleo_F207ZG.menu.log.fatal=FATAL
Nucleo_F207ZG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
Nucleo_F207ZG.menu.log.error=ERROR
Nucleo_F207ZG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
Nucleo_F207ZG.menu.log.warning=WARNING
Nucleo_F207ZG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
Nucleo_F207ZG.menu.log.info=INFO
Nucleo_F207ZG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
Nucleo_F207ZG.menu.log.debug=DEBUG
Nucleo_F207ZG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
Nucleo_F207ZG.menu.log.trace=TRACE
Nucleo_F207ZG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#################################### Nucleo-F401RE(84M) ##########################################
#Nucleo-F401RE(84M) board
Nucleo-F401RE.name=Nucleo-F401RE(84M)[SerialUART2]
Nucleo-F401RE.vid.0=0x0483
Nucleo-F401RE.pid.0=0x374B

Nucleo-F401RE.build.core=arduino
Nucleo-F401RE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

Nucleo-F401RE.upload.maximum_size=524288
Nucleo-F401RE.upload.maximum_data_size=98304
Nucleo-F401RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo-F401RE.build.series=STM32F4
Nucleo-F401RE.build.variant=NUCLEO_F401RE
Nucleo-F401RE.build.board=NUCLEO_F401RE
Nucleo-F401RE.build.f_cpuhsi=84000000L
Nucleo-F401RE.build.f_cpuhse=84000000L
Nucleo-F401RE.build.extra_flags0=-DSTM32F401RE
Nucleo-F401RE.build.ldscript_pre=ld/F401xE

Nucleo-F401RE.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
Nucleo-F401RE.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

Nucleo-F401RE.menu.clock_source.hsi=HSE_Disable(HSI)
Nucleo-F401RE.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

Nucleo-F401RE.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
Nucleo-F401RE.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000

Nucleo-F401RE.menu.startadr.default=flash(512k+96k)
Nucleo-F401RE.menu.startadr.default.build.extra_flags={build.extra_flags0}

Nucleo-F401RE.menu.startadr.F08020000=flash 1:0x08020000(128k)
Nucleo-F401RE.menu.startadr.F08020000.upload.maximum_size=131072
Nucleo-F401RE.menu.startadr.F08020000.upload.maximum_data_size=98304
Nucleo-F401RE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
Nucleo-F401RE.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
Nucleo-F401RE.menu.startadr.F08020000.upload.uploadadr=0x08020000
Nucleo-F401RE.menu.startadr.F08020000.upload.vect=0x08020000

Nucleo-F401RE.menu.startadr.F08040000=flash 2:0x08040000(128k)
Nucleo-F401RE.menu.startadr.F08040000.upload.maximum_size=131072
Nucleo-F401RE.menu.startadr.F08040000.upload.maximum_data_size=98304
Nucleo-F401RE.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
Nucleo-F401RE.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
Nucleo-F401RE.menu.startadr.F08040000.upload.uploadadr=0x08040000
Nucleo-F401RE.menu.startadr.F08040000.upload.vect=0x08040000

Nucleo-F401RE.menu.startadr.F08060000=flash 3:0x08060000(128k)
Nucleo-F401RE.menu.startadr.F08060000.upload.maximum_size=131072
Nucleo-F401RE.menu.startadr.F08060000.upload.maximum_data_size=98304
Nucleo-F401RE.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
Nucleo-F401RE.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
Nucleo-F401RE.menu.startadr.F08060000.upload.uploadadr=0x08060000
Nucleo-F401RE.menu.startadr.F08060000.upload.vect=0x08060000

Nucleo-F401RE.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
Nucleo-F401RE.menu.startadr.F08000000.upload.maximum_size=131072
Nucleo-F401RE.menu.startadr.F08000000.upload.maximum_data_size=32768
Nucleo-F401RE.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
Nucleo-F401RE.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
Nucleo-F401RE.menu.startadr.F08000000.upload.uploadadr=0x08000000
Nucleo-F401RE.menu.startadr.F08000000.upload.vect=0x08000000

Nucleo-F401RE.menu.startadr.R20000000=Sram 0:0x20000000(64K+32K BOOT=11 St/Jlink uploader only)
Nucleo-F401RE.menu.startadr.R20000000.upload.maximum_size=65536
Nucleo-F401RE.menu.startadr.R20000000.upload.maximum_data_size=32768
Nucleo-F401RE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo-F401RE.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo-F401RE.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo-F401RE.menu.startadr.R20000000.upload.vect=0x20000000

Nucleo-F401RE.menu.extern_lib.NONE=NONE
Nucleo-F401RE.menu.extern_lib.STemWin=STemWin
Nucleo-F401RE.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
Nucleo-F401RE.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
Nucleo-F401RE.menu.extern_lib.STemWinOS=STemWin_OS
Nucleo-F401RE.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
Nucleo-F401RE.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

Nucleo-F401RE.upload.protocol=STLink
Nucleo-F401RE.upload.tool=stlink_upload

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
Nucleo-F401RE.menu.log.default=Release(no-exceptions)
Nucleo-F401RE.menu.log.default.build.log_level=-fno-exceptions
Nucleo-F401RE.menu.log.Release=Release(exceptions)
Nucleo-F401RE.menu.log.fatal=FATAL
Nucleo-F401RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
Nucleo-F401RE.menu.log.error=ERROR
Nucleo-F401RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
Nucleo-F401RE.menu.log.warning=WARNING
Nucleo-F401RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
Nucleo-F401RE.menu.log.info=INFO
Nucleo-F401RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
Nucleo-F401RE.menu.log.debug=DEBUG
Nucleo-F401RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
Nucleo-F401RE.menu.log.trace=TRACE
Nucleo-F401RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#################################### Nucleo-F411RE(96M) #########################################
# NUCLEO 64 board
Nucleo-F411RE.name=Nucleo-F411RE(96M)[SerialUART2]
Nucleo-F411RE.vid.0=0x0483
Nucleo-F411RE.pid.0=0x374B

