tony-cloud/STM32_duino/boards.txt
Nucleo-F411RE.build.core=arduino
Nucleo-F411RE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

Nucleo-F411RE.upload.maximum_size=524288
Nucleo-F411RE.upload.maximum_data_size=131072
Nucleo-F411RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo-F411RE.build.series=STM32F4
Nucleo-F411RE.build.variant=NUCLEO_F411RE
Nucleo-F411RE.build.board=NUCLEO_F411RE
Nucleo-F411RE.build.f_cpuhsi=96000000L
Nucleo-F411RE.build.f_cpuhse=96000000L
Nucleo-F411RE.build.extra_flags0=-DSTM32F411RE
Nucleo-F411RE.build.ldscript_pre=ld/F411xE

Nucleo-F411RE.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
Nucleo-F411RE.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

Nucleo-F411RE.menu.clock_source.hsi=HSE_Disable(HSI)
Nucleo-F411RE.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

Nucleo-F411RE.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
Nucleo-F411RE.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000

Nucleo-F411RE.menu.startadr.default=flash(512k+128k)
Nucleo-F411RE.menu.startadr.default.build.extra_flags={build.extra_flags0}

Nucleo-F411RE.menu.startadr.F08020000=flash 1:0x08020000(128k)
Nucleo-F411RE.menu.startadr.F08020000.upload.maximum_size=131072
Nucleo-F411RE.menu.startadr.F08020000.upload.maximum_data_size=131072
Nucleo-F411RE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
Nucleo-F411RE.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
Nucleo-F411RE.menu.startadr.F08020000.upload.uploadadr=0x08020000
Nucleo-F411RE.menu.startadr.F08020000.upload.vect=0x08020000

Nucleo-F411RE.menu.startadr.F08040000=flash 2:0x08040000(128k)
Nucleo-F411RE.menu.startadr.F08040000.upload.maximum_size=131072
Nucleo-F411RE.menu.startadr.F08040000.upload.maximum_data_size=131072
Nucleo-F411RE.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
Nucleo-F411RE.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
Nucleo-F411RE.menu.startadr.F08040000.upload.uploadadr=0x08040000
Nucleo-F411RE.menu.startadr.F08040000.upload.vect=0x08040000

Nucleo-F411RE.menu.startadr.F08060000=flash 3:0x08060000(128k)
Nucleo-F411RE.menu.startadr.F08060000.upload.maximum_size=131072
Nucleo-F411RE.menu.startadr.F08060000.upload.maximum_data_size=131072
Nucleo-F411RE.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
Nucleo-F411RE.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
Nucleo-F411RE.menu.startadr.F08060000.upload.uploadadr=0x08060000
Nucleo-F411RE.menu.startadr.F08060000.upload.vect=0x08060000

Nucleo-F411RE.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
Nucleo-F411RE.menu.startadr.F08000000.upload.maximum_size=131072
Nucleo-F411RE.menu.startadr.F08000000.upload.maximum_data_size=32768
Nucleo-F411RE.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
Nucleo-F411RE.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
Nucleo-F411RE.menu.startadr.F08000000.upload.uploadadr=0x08000000
Nucleo-F411RE.menu.startadr.F08000000.upload.vect=0x08000000

Nucleo-F411RE.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
Nucleo-F411RE.menu.startadr.R20000000.upload.maximum_size=98304
Nucleo-F411RE.menu.startadr.R20000000.upload.maximum_data_size=32768
Nucleo-F411RE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo-F411RE.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo-F411RE.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo-F411RE.menu.startadr.R20000000.upload.vect=0x20000000

Nucleo-F411RE.menu.extern_lib.NONE=NONE
Nucleo-F411RE.menu.extern_lib.STemWin=STemWin
Nucleo-F411RE.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
Nucleo-F411RE.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
Nucleo-F411RE.menu.extern_lib.STemWinOS=STemWin_OS
Nucleo-F411RE.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
Nucleo-F411RE.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

Nucleo-F411RE.upload.protocol=STLink
Nucleo-F411RE.upload.tool=stlink_upload

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
Nucleo-F411RE.menu.log.default=Release(no-exceptions)
Nucleo-F411RE.menu.log.default.build.log_level=-fno-exceptions
Nucleo-F411RE.menu.log.Release=Release(exceptions)
Nucleo-F411RE.menu.log.fatal=FATAL
Nucleo-F411RE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
Nucleo-F411RE.menu.log.error=ERROR
Nucleo-F411RE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
Nucleo-F411RE.menu.log.warning=WARNING
Nucleo-F411RE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
Nucleo-F411RE.menu.log.info=INFO
Nucleo-F411RE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
Nucleo-F411RE.menu.log.debug=DEBUG
Nucleo-F411RE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
Nucleo-F411RE.menu.log.trace=TRACE
Nucleo-F411RE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#################################### Nucleo-F767ZI ############################################
#Nucleo_F767ZI board

Nucleo_F767ZI.name=Nucleo-F767ZI(216M)[SerialUART3]
Nucleo_F767ZI.vid.0=0x0483
Nucleo_F767ZI.pid.0=0x374B

Nucleo_F767ZI.build.core=arduino
Nucleo_F767ZI.build.variant=NUCLEO_F767ZI
Nucleo_F767ZI.build.board=NUCLEO_F767ZI
Nucleo_F767ZI.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3
Nucleo_F767ZI.build.mcu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard 
Nucleo_F767ZI.build.series=STM32F7
Nucleo_F767ZI.build.extra_flags0=-DSTM32F767ZI
Nucleo_F767ZI.build.ldscript_pre=ld/f767xI
Nucleo_F767ZI.build.f_cpupre=216000000L

Nucleo_F767ZI.upload.maximum_size=2097152
Nucleo_F767ZI.upload.maximum_data_size=524288
Nucleo_F767ZI.upload.uploadadr=0x08000000
Nucleo_F767ZI.upload.vect=0x08000000
Nucleo_F767ZI.upload.device=STM32F767ZI
Nucleo_F767ZI.upload.protocol=STLink
Nucleo_F767ZI.upload.tool=stlink_upload

Nucleo_F767ZI.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
Nucleo_F767ZI.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

Nucleo_F767ZI.menu.clock_source.hsi=HSE_Disable(HSI)
Nucleo_F767ZI.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

Nucleo_F767ZI.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
Nucleo_F767ZI.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

Nucleo_F767ZI.menu.startadr.default=flash(2048k+512k)
Nucleo_F767ZI.menu.startadr.default.build.extra_flags={build.extra_flags0}

