tony-cloud/STM32_duino/boards.txt
Nucleo_F767ZI.menu.startadr.F08040000=flash 1:0x08040000(256k)
Nucleo_F767ZI.menu.startadr.F08040000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08040000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
Nucleo_F767ZI.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
Nucleo_F767ZI.menu.startadr.F08040000.upload.uploadadr=0x08040000
Nucleo_F767ZI.menu.startadr.F08040000.upload.vect=0x08040000

Nucleo_F767ZI.menu.startadr.F08080000=flash 2:0x08080000(256k)
Nucleo_F767ZI.menu.startadr.F08080000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08080000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
Nucleo_F767ZI.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
Nucleo_F767ZI.menu.startadr.F08080000.upload.uploadadr=0x08080000
Nucleo_F767ZI.menu.startadr.F08080000.upload.vect=0x08080000

Nucleo_F767ZI.menu.startadr.F080C0000=flash 3:0x080C0000(256k)
Nucleo_F767ZI.menu.startadr.F080C0000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F080C0000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
Nucleo_F767ZI.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
Nucleo_F767ZI.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
Nucleo_F767ZI.menu.startadr.F080C0000.upload.vect=0x080C0000

Nucleo_F767ZI.menu.startadr.F08100000=flash 4:0x08100000(256k)
Nucleo_F767ZI.menu.startadr.F08100000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08100000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08100000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x100000
Nucleo_F767ZI.menu.startadr.F08100000.build.ldscript={build.ldscript_pre}_0810.ld
Nucleo_F767ZI.menu.startadr.F08100000.upload.uploadadr=0x08100000
Nucleo_F767ZI.menu.startadr.F08100000.upload.vect=0x08100000

Nucleo_F767ZI.menu.startadr.F08140000=flash 5:0x08140000(256k)
Nucleo_F767ZI.menu.startadr.F08140000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08140000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08140000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x140000
Nucleo_F767ZI.menu.startadr.F08140000.build.ldscript={build.ldscript_pre}_0814.ld
Nucleo_F767ZI.menu.startadr.F08140000.upload.uploadadr=0x08140000
Nucleo_F767ZI.menu.startadr.F08140000.upload.vect=0x08140000

Nucleo_F767ZI.menu.startadr.F08180000=flash 6:0x08180000(256k)
Nucleo_F767ZI.menu.startadr.F08180000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08180000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F08180000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x180000
Nucleo_F767ZI.menu.startadr.F08180000.build.ldscript={build.ldscript_pre}_0818.ld
Nucleo_F767ZI.menu.startadr.F08180000.upload.uploadadr=0x08180000
Nucleo_F767ZI.menu.startadr.F08180000.upload.vect=0x08180000

Nucleo_F767ZI.menu.startadr.F081C0000=flash 7:0x081C0000(256k)
Nucleo_F767ZI.menu.startadr.F081C0000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F081C0000.upload.maximum_data_size=524288
Nucleo_F767ZI.menu.startadr.F081C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x1C0000
Nucleo_F767ZI.menu.startadr.F081C0000.build.ldscript={build.ldscript_pre}_081C.ld
Nucleo_F767ZI.menu.startadr.F081C0000.upload.uploadadr=0x081C0000
Nucleo_F767ZI.menu.startadr.F081C0000.upload.vect=0x081C0000

Nucleo_F767ZI.menu.startadr.F08000000=flash(WithRamBoot used 256kRAM Only)
Nucleo_F767ZI.menu.startadr.F08000000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.F08000000.upload.maximum_data_size=262144
Nucleo_F767ZI.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
Nucleo_F767ZI.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
Nucleo_F767ZI.menu.startadr.F08000000.upload.uploadadr=0x08000000
Nucleo_F767ZI.menu.startadr.F08000000.upload.vect=0x08000000

Nucleo_F767ZI.menu.startadr.R20000000=Sram 0:0x20000000(256K+256K use bootloader only)
Nucleo_F767ZI.menu.startadr.R20000000.upload.maximum_size=262144
Nucleo_F767ZI.menu.startadr.R20000000.upload.maximum_data_size=262144
Nucleo_F767ZI.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
Nucleo_F767ZI.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
Nucleo_F767ZI.menu.startadr.R20000000.upload.uploadadr=0x20000000
Nucleo_F767ZI.menu.startadr.R20000000.upload.vect=0x20000000


#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
Nucleo_F767ZI.menu.log.default=Release(no-exceptions)
Nucleo_F767ZI.menu.log.default.build.log_level=-fno-exceptions
Nucleo_F767ZI.menu.log.Release=Release(exceptions)
Nucleo_F767ZI.menu.log.fatal=FATAL
Nucleo_F767ZI.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
Nucleo_F767ZI.menu.log.error=ERROR
Nucleo_F767ZI.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
Nucleo_F767ZI.menu.log.warning=WARNING
Nucleo_F767ZI.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
Nucleo_F767ZI.menu.log.info=INFO
Nucleo_F767ZI.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
Nucleo_F767ZI.menu.log.debug=DEBUG
Nucleo_F767ZI.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
Nucleo_F767ZI.menu.log.trace=TRACE
Nucleo_F767ZI.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#################################### Nucleo-H743ZI ############################################
#Nucleo_H743ZI board

Nucleo_H743ZI.name=Nucleo-H743ZI(400M)[SerialUART3]
Nucleo_H743ZI.vid.0=0x0483
Nucleo_H743ZI.pid.0=0x374B

Nucleo_H743ZI.build.core=arduino
Nucleo_H743ZI.build.variant=NUCLEO_H743ZI
Nucleo_H743ZI.build.board=NUCLEO_H743ZI
Nucleo_H743ZI.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART3
Nucleo_H743ZI.build.mcu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard 
Nucleo_H743ZI.build.series=STM32H7
Nucleo_H743ZI.build.extra_flags0=-DSTM32H743ZI
Nucleo_H743ZI.build.ldscript_pre=ld/h743xI
Nucleo_H743ZI.build.f_cpupre=400000000L

Nucleo_H743ZI.upload.maximum_size=2097152
Nucleo_H743ZI.upload.maximum_data_size=131072
Nucleo_H743ZI.upload.uploadadr=0x08000000
Nucleo_H743ZI.upload.vect=0x08000000
Nucleo_H743ZI.upload.device=STM32H743ZI
Nucleo_H743ZI.upload.protocol=STLink
Nucleo_H743ZI.upload.tool=stlink_upload

