tony-cloud/STM32_duino/boards.txt
NUCLEO_L476.upload.maximum_size=1048576
NUCLEO_L476.upload.maximum_data_size=98308
NUCLEO_L476.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_L476.build.series=STM32L4
NUCLEO_L476.build.f_cpuhsi=80000000L
NUCLEO_L476.build.f_cpuhse=80000000L
NUCLEO_L476.build.extra_flags0=-DSTM32L476RG
NUCLEO_L476.build.ldscript_pre=ld/L476xG
NUCLEO_L476.massstorage_drive=NODE_L476RG

NUCLEO_L476.menu.clock_source.msi=HSE_Disable(MSI)
NUCLEO_L476.menu.clock_source.msi.build.f_cpu={build.f_cpuhsi} -DUSE_MSI

NUCLEO_L476.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_L476.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

NUCLEO_L476.menu.clock_source.bypass=HSE_BYPASS_Clock_Source(If SB50 closed)
NUCLEO_L476.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

NUCLEO_L476.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_L476.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000

NUCLEO_L476.menu.startadr.default=flash(default)
NUCLEO_L476.menu.startadr.default.build.extra_flags={build.extra_flags0}

NUCLEO_L476.menu.startadr.F08020000=flash 1:0x08020000(128k)
NUCLEO_L476.menu.startadr.F08020000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08020000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
NUCLEO_L476.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
NUCLEO_L476.menu.startadr.F08020000.upload.uploadadr=0x08020000
NUCLEO_L476.menu.startadr.F08020000.upload.vect=0x08020000

NUCLEO_L476.menu.startadr.F08040000=flash 2:0x08040000(128k)
NUCLEO_L476.menu.startadr.F08040000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08040000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
NUCLEO_L476.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
NUCLEO_L476.menu.startadr.F08040000.upload.uploadadr=0x08040000
NUCLEO_L476.menu.startadr.F08040000.upload.vect=0x08040000

NUCLEO_L476.menu.startadr.F08060000=flash 3:0x08060000(128k)
NUCLEO_L476.menu.startadr.F08060000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08060000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
NUCLEO_L476.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
NUCLEO_L476.menu.startadr.F08060000.upload.uploadadr=0x08060000
NUCLEO_L476.menu.startadr.F08060000.upload.vect=0x08060000

NUCLEO_L476.menu.startadr.F08080000=flash 4:0x08080000(128k)
NUCLEO_L476.menu.startadr.F08080000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08080000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
NUCLEO_L476.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
NUCLEO_L476.menu.startadr.F08080000.upload.uploadadr=0x08080000
NUCLEO_L476.menu.startadr.F08080000.upload.vect=0x08080000

NUCLEO_L476.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
NUCLEO_L476.menu.startadr.F080A0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080A0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
NUCLEO_L476.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
NUCLEO_L476.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
NUCLEO_L476.menu.startadr.F080A0000.upload.vect=0x080A0000

NUCLEO_L476.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
NUCLEO_L476.menu.startadr.F080C0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080C0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
NUCLEO_L476.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
NUCLEO_L476.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
NUCLEO_L476.menu.startadr.F080C0000.upload.vect=0x080C0000

NUCLEO_L476.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
NUCLEO_L476.menu.startadr.F080E0000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F080E0000.upload.maximum_data_size=98308
NUCLEO_L476.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
NUCLEO_L476.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
NUCLEO_L476.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
NUCLEO_L476.menu.startadr.F080E0000.upload.vect=0x080E0000

NUCLEO_L476.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
NUCLEO_L476.menu.startadr.F08000000.upload.maximum_size=131072
NUCLEO_L476.menu.startadr.F08000000.upload.maximum_data_size=32768
NUCLEO_L476.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
NUCLEO_L476.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
NUCLEO_L476.menu.startadr.F08000000.upload.uploadadr=0x08000000
NUCLEO_L476.menu.startadr.F08000000.upload.vect=0x08000000

NUCLEO_L476.menu.startadr.R20000000=Sram 0:0x20000000(64K+32K BOOT=11 St/Jlink uploader only)
NUCLEO_L476.menu.startadr.R20000000.upload.maximum_size=65536
NUCLEO_L476.menu.startadr.R20000000.upload.maximum_data_size=32768
NUCLEO_L476.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
NUCLEO_L476.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
NUCLEO_L476.menu.startadr.R20000000.upload.uploadadr=0x20000000
NUCLEO_L476.menu.startadr.R20000000.upload.vect=0x20000000

NUCLEO_L476.menu.extern_lib.NONE=NONE
NUCLEO_L476.menu.extern_lib.STemWin=STemWin
NUCLEO_L476.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
NUCLEO_L476.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
NUCLEO_L476.menu.extern_lib.STemWinOS=STemWin_OS
NUCLEO_L476.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
NUCLEO_L476.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

NUCLEO_L476.upload.protocol=STLink
NUCLEO_L476.upload.tool=stlink_upload


