tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUCLEO_L476.menu.log.default=Release(no-exceptions)
NUCLEO_L476.menu.log.default.build.log_level=-fno-exceptions
NUCLEO_L476.menu.log.Release=Release(exceptions)
NUCLEO_L476.menu.log.fatal=FATAL
NUCLEO_L476.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.error=ERROR
NUCLEO_L476.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.warning=WARNING
NUCLEO_L476.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.info=INFO
NUCLEO_L476.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.debug=DEBUG
NUCLEO_L476.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUCLEO_L476.menu.log.trace=TRACE
NUCLEO_L476.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

#################################### NUCLEO_L4R5 ############################################
# Nucleo 144 board
NUCLEO_L4R5.name=Nucleo-L4R5ZI(120M)[LPUART1]
NUCLEO_L4R5.vid.0=0x0483
NUCLEO_L4R5.pid.0=0x374B

NUCLEO_L4R5.build.core=arduino
NUCLEO_L4R5.build.variant=NUCLEO_L4R5ZI
NUCLEO_L4R5.build.board=NUCLEO_L4R5ZI

NUCLEO_L4R5.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialLPUART1

NUCLEO_L4R5.upload.maximum_size=2097152
NUCLEO_L4R5.upload.maximum_data_size=655360
NUCLEO_L4R5.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_L4R5.build.series=STM32L4
NUCLEO_L4R5.build.f_cpuhsi=120000000L
NUCLEO_L4R5.build.f_cpuhse=120000000L
NUCLEO_L4R5.build.extra_flags0=-DSTM32L4R5ZI
NUCLEO_L4R5.build.ldscript_pre=ld/L4R5xI
NUCLEO_L4R5.massstorage_drive=NODE_L4R5ZI

NUCLEO_L4R5.menu.clock_source.msi=HSE_Disable(MSI)
NUCLEO_L4R5.menu.clock_source.msi.build.f_cpu={build.f_cpuhsi} -DUSE_MSI

NUCLEO_L4R5.menu.clock_source.hsi=HSE_Disable(HSI)
NUCLEO_L4R5.menu.clock_source.hsi.build.f_cpu={build.f_cpuhsi} -DUSE_HSI

NUCLEO_L4R5.menu.clock_source.bypass=HSE_BYPASS_Clock_Source(if SB148 closed)
NUCLEO_L4R5.menu.clock_source.bypass.build.f_cpu={build.f_cpuhse} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

NUCLEO_L4R5.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
NUCLEO_L4R5.menu.clock_source.hse8m.build.f_cpu={build.f_cpuhse} -DUSE_HSE -DHSE_VALUE=8000000

NUCLEO_L4R5.menu.startadr.default=flash(default)
NUCLEO_L4R5.menu.startadr.default.build.extra_flags={build.extra_flags0}

NUCLEO_L4R5.menu.startadr.F08040000=flash 1:0x08040000(256K)
NUCLEO_L4R5.menu.startadr.F08040000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08040000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
NUCLEO_L4R5.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
NUCLEO_L4R5.menu.startadr.F08040000.upload.uploadadr=0x08040000
NUCLEO_L4R5.menu.startadr.F08040000.upload.vect=0x08040000

NUCLEO_L4R5.menu.startadr.F08080000=flash 2:0x08080000(256k)
NUCLEO_L4R5.menu.startadr.F08080000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08080000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
NUCLEO_L4R5.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
NUCLEO_L4R5.menu.startadr.F08080000.upload.uploadadr=0x08080000
NUCLEO_L4R5.menu.startadr.F08080000.upload.vect=0x08080000

NUCLEO_L4R5.menu.startadr.F080C0000=flash 3:0x080C0000(256k)
NUCLEO_L4R5.menu.startadr.F080C0000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F080C0000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
NUCLEO_L4R5.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
NUCLEO_L4R5.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
NUCLEO_L4R5.menu.startadr.F080C0000.upload.vect=0x080C0000

NUCLEO_L4R5.menu.startadr.F08100000=flash 4:0x08100000(256k)
NUCLEO_L4R5.menu.startadr.F08100000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08100000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F08100000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x100000
NUCLEO_L4R5.menu.startadr.F08100000.build.ldscript={build.ldscript_pre}_0810.ld
NUCLEO_L4R5.menu.startadr.F08100000.upload.uploadadr=0x08100000
NUCLEO_L4R5.menu.startadr.F08100000.upload.vect=0x08100000

NUCLEO_L4R5.menu.startadr.F08140000=flash 5:0x08140000(256k)
NUCLEO_L4R5.menu.startadr.F08140000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08140000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F08140000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x140000
NUCLEO_L4R5.menu.startadr.F08140000.build.ldscript={build.ldscript_pre}_0814.ld
NUCLEO_L4R5.menu.startadr.F08140000.upload.uploadadr=0x08140000
NUCLEO_L4R5.menu.startadr.F08140000.upload.vect=0x08140000

NUCLEO_L4R5.menu.startadr.F08180000=flash 6:0x08180000(256k)
NUCLEO_L4R5.menu.startadr.F08180000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08180000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F08180000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x180000
NUCLEO_L4R5.menu.startadr.F08180000.build.ldscript={build.ldscript_pre}_0818.ld
NUCLEO_L4R5.menu.startadr.F08180000.upload.uploadadr=0x08180000
NUCLEO_L4R5.menu.startadr.F08180000.upload.vect=0x08180000

NUCLEO_L4R5.menu.startadr.F081C0000=flash 7:0x081C0000(256k)
NUCLEO_L4R5.menu.startadr.F081C0000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F081C0000.upload.maximum_data_size=655360
NUCLEO_L4R5.menu.startadr.F081C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x1C0000
NUCLEO_L4R5.menu.startadr.F081C0000.build.ldscript={build.ldscript_pre}_081C.ld
NUCLEO_L4R5.menu.startadr.F081C0000.upload.uploadadr=0x081C0000
NUCLEO_L4R5.menu.startadr.F081C0000.upload.vect=0x081C0000

NUCLEO_L4R5.menu.startadr.F08000000=flash(WithRamBoot 256kRAM used Only)
NUCLEO_L4R5.menu.startadr.F08000000.upload.maximum_size=262144
NUCLEO_L4R5.menu.startadr.F08000000.upload.maximum_data_size=262144
NUCLEO_L4R5.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
NUCLEO_L4R5.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
NUCLEO_L4R5.menu.startadr.F08000000.upload.uploadadr=0x08000000
NUCLEO_L4R5.menu.startadr.F08000000.upload.vect=0x08000000

NUCLEO_L4R5.menu.startadr.R20000000=Sram 0:0x20000000(384K+256K BOOT=11 St/Jlink uploader only)
NUCLEO_L4R5.menu.startadr.R20000000.upload.maximum_size=393216
NUCLEO_L4R5.menu.startadr.R20000000.upload.maximum_data_size=262144
NUCLEO_L4R5.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
NUCLEO_L4R5.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
NUCLEO_L4R5.menu.startadr.R20000000.upload.uploadadr=0x20000000
NUCLEO_L4R5.menu.startadr.R20000000.upload.vect=0x20000000

NUCLEO_L4R5.menu.extern_lib.NONE=NONE
NUCLEO_L4R5.menu.extern_lib.STemWin=STemWin
NUCLEO_L4R5.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
NUCLEO_L4R5.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
NUCLEO_L4R5.menu.extern_lib.STemWinOS=STemWin_OS
NUCLEO_L4R5.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
NUCLEO_L4R5.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

NUCLEO_L4R5.upload.protocol=STLink
NUCLEO_L4R5.upload.tool=stlink_upload


