tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUCLEO_L4R5.menu.log.default=Release(no-exceptions)
NUCLEO_L4R5.menu.log.default.build.log_level=-fno-exceptions
NUCLEO_L4R5.menu.log.Release=Release(exceptions)
NUCLEO_L4R5.menu.log.fatal=FATAL
NUCLEO_L4R5.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
NUCLEO_L4R5.menu.log.error=ERROR
NUCLEO_L4R5.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
NUCLEO_L4R5.menu.log.warning=WARNING
NUCLEO_L4R5.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
NUCLEO_L4R5.menu.log.info=INFO
NUCLEO_L4R5.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
NUCLEO_L4R5.menu.log.debug=DEBUG
NUCLEO_L4R5.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
NUCLEO_L4R5.menu.log.trace=TRACE
NUCLEO_L4R5.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### Discovery L053C8 ###########################################
# Discovery L053C8 board(32M)

DISCOVERY_L053C8.name=Discovery L053C8

DISCOVERY_L053C8.upload.maximum_size=65536
DISCOVERY_L053C8.upload.maximum_data_size=8192

DISCOVERY_L053C8.build.core=arduino
DISCOVERY_L053C8.build.board=DISCOVERY_L053C8

DISCOVERY_L053C8.build.mcu=cortex-m0plus
DISCOVERY_L053C8.build.series=STM32L0
DISCOVERY_L053C8.build.variant=DISCOVERY_L053C8
DISCOVERY_L053C8.build.extra_flags=-DSTM32L053C8
DISCOVERY_L053C8.build.f_cpupre=32000000L

DISCOVERY_L053C8.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_L053C8.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_L053C8.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_L053C8.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_L053C8.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_L053C8.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

DISCOVERY_L053C8.menu.upload_method.STLinkMethod=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_L053C8.menu.upload_method.STLinkMethod.upload.tool=stlink_upload


DISCOVERY_L053C8.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_L053C8.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

DISCOVERY_L053C8.menu.usb.Disabled=Disabled USB
DISCOVERY_L053C8.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
DISCOVERY_L053C8.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_L053C8.menu.usb.SerialMSC=Mass storage
DISCOVERY_L053C8.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_L053C8.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
DISCOVERY_L053C8.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_L053C8.menu.serial.SerialUSB=SerialUSB (USB connector)
DISCOVERY_L053C8.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_L053C8.menu.log.default=Release(no-exceptions)
DISCOVERY_L053C8.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_L053C8.menu.log.Release=Release(exceptions)
DISCOVERY_L053C8.menu.log.fatal=FATAL
DISCOVERY_L053C8.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_L053C8.menu.log.error=ERROR
DISCOVERY_L053C8.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_L053C8.menu.log.warning=WARNING
DISCOVERY_L053C8.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_L053C8.menu.log.info=INFO
DISCOVERY_L053C8.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_L053C8.menu.log.debug=DEBUG
DISCOVERY_L053C8.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_L053C8.menu.log.trace=TRACE
DISCOVERY_L053C8.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### Discovery L152RC ###########################################
# Discovery L152RC board(32M)

DISCOVERY_L152R.name=Discovery L152R

DISCOVERY_L152R.build.core=arduino
DISCOVERY_L152R.build.board=DISCOVERY_L152RC

DISCOVERY_L152R.build.mcu=cortex-m3
DISCOVERY_L152R.build.series=STM32L1

DISCOVERY_L152R.menu.subboard.L152RB=L152RB
DISCOVERY_L152R.menu.subboard.L152RB.upload.maximum_size=131072
DISCOVERY_L152R.menu.subboard.L152RB.upload.maximum_data_size=16384
DISCOVERY_L152R.menu.subboard.L152RB.build.variant=DISCOVERY_L152RC
DISCOVERY_L152R.menu.subboard.L152RB.build.extra_flags=-DSTM32L152RB
DISCOVERY_L152R.menu.subboard.L152RB.build.ldscript=ld/l152rb.ld

DISCOVERY_L152R.menu.subboard.L152RC=L152RC
DISCOVERY_L152R.menu.subboard.L152RC.upload.maximum_size=262144
DISCOVERY_L152R.menu.subboard.L152RC.upload.maximum_data_size=32768
DISCOVERY_L152R.menu.subboard.L152RC.build.variant=DISCOVERY_L152RC
DISCOVERY_L152R.menu.subboard.L152RC.build.extra_flags=-DSTM32L152RC
DISCOVERY_L152R.menu.subboard.L152RC.build.ldscript=ld/l152rc.ld

DISCOVERY_L152R.menu.extern_lib.NONE=NONE
DISCOVERY_L152R.menu.extern_lib.STemWin=STemWin
DISCOVERY_L152R.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
DISCOVERY_L152R.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
DISCOVERY_L152R.menu.extern_lib.STemWinOS=STemWin_OS
DISCOVERY_L152R.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
DISCOVERY_L152R.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

DISCOVERY_L152R.build.f_cpupre=32000000L

DISCOVERY_L152R.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_L152R.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_L152R.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_L152R.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

