tony-cloud/STM32_duino/boards.txt
DISCOVERY_F746NG.build.mcu=cortex-m7 -mfloat-abi=hard -mfpu=fpv4-sp-d16
DISCOVERY_F746NG.build.series=STM32F7
DISCOVERY_F746NG.build.variant=DISCOVERY_F746NG
DISCOVERY_F746NG.build.f_cpupre=216000000L
DISCOVERY_F746NG.build.extra_flags=-DSTM32F746NG

DISCOVERY_F746NG.menu.clock_source.bypass=HSE_BYPASS_Clock_Source
DISCOVERY_F746NG.menu.clock_source.bypass.build.f_cpu={build.f_cpupre} -DUSE_HSEBYPASS -DHSE_VALUE=8000000

DISCOVERY_F746NG.menu.clock_source.hsi=HSE_Disable(HSI)
DISCOVERY_F746NG.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

DISCOVERY_F746NG.menu.clock_source.hse8m=HSE_Crystal(If 8M crystal is installed)
DISCOVERY_F746NG.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

#DISCOVERY_F746NG.upload.protocol=STLink
#DISCOVERY_F746NG.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.STLinkMethod=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.massstorage_drive=DIS_F746NG

DISCOVERY_F746NG.menu.usb.Disabled=Disabled USB
DISCOVERY_F746NG.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
DISCOVERY_F746NG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F746NG.menu.usb.SerialMSC=Mass storage
DISCOVERY_F746NG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE

DISCOVERY_F746NG.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PA9]
DISCOVERY_F746NG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F746NG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F746NG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
DISCOVERY_F746NG.menu.log.default=Release(no-exceptions)
DISCOVERY_F746NG.menu.log.default.build.log_level=-fno-exceptions
DISCOVERY_F746NG.menu.log.Release=Release(exceptions)
DISCOVERY_F746NG.menu.log.fatal=FATAL
DISCOVERY_F746NG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.error=ERROR
DISCOVERY_F746NG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.warning=WARNING
DISCOVERY_F746NG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.info=INFO
DISCOVERY_F746NG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.debug=DEBUG
DISCOVERY_F746NG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
DISCOVERY_F746NG.menu.log.trace=TRACE
DISCOVERY_F746NG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

######################################F030#######################################
F030F.name=F030F

F030F.upload.uploadadr=0x08000000
F030F.upload.vect=0x08000000
F030F.serial.disableDTR=true
F030F.serial.disableRTS=true

F030F.build.board=F030F
F030F.build.core=arduino
F030F.build.series=STM32F0
F030F.build.mcu=cortex-m0
F030F.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

F030F.menu.subboard.F030F4P632=GENERIC_F030F4P6(32kFlash LED PA4)
F030F.menu.subboard.F030F4P632.upload.maximum_size=32768
F030F.menu.subboard.F030F4P632.upload.maximum_data_size=4096
F030F.menu.subboard.F030F4P632.upload.device=STM32F030F4
F030F.menu.subboard.F030F4P632.build.extra_flags=-DSTM32F030F4
F030F.menu.subboard.F030F4P632.build.variant=F030F4P6
F030F.menu.subboard.F030F4P632.build.board=F030F4P6
F030F.menu.subboard.F030F4P632.build.ldscript=ld/f030f4p6_32.ld

F030F.menu.subboard.F030F4P6=GENERIC_F030F4P6(16kFlash LED PA4)
F030F.menu.subboard.F030F4P6.upload.maximum_size=16384
F030F.menu.subboard.F030F4P6.upload.maximum_data_size=4096
F030F.menu.subboard.F030F4P6.upload.device=STM32F030F4
F030F.menu.subboard.F030F4P6.build.extra_flags=-DSTM32F030F4
F030F.menu.subboard.F030F4P6.build.variant=F030F4P6
F030F.menu.subboard.F030F4P6.build.board=F030F4P6
F030F.menu.subboard.F030F4P6.build.ldscript=ld/f030f4p6.ld

F030F.menu.osc_speed.speed_08m=8M(HSE)_48M(default)
F030F.menu.osc_speed.speed_08m.build.f_cpu=48000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_08m72=8M(HSE)_72M(Stable)
F030F.menu.osc_speed.speed_08m72.build.f_cpu=72000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_08m96=8M(HSE)_96M(overdrive)
F030F.menu.osc_speed.speed_08m96.build.f_cpu=96000000L -DHSE_VALUE=8000000

F030F.menu.osc_speed.speed_hsi=8M(HSI)_48M
F030F.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F030F.menu.upload_method.jLinkMethod=JLink
F030F.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F030F.menu.upload_method.jLinkMethod.upload.protocol=jlink

F030F.menu.upload_method.STLinkMethod=STLink 
F030F.menu.upload_method.STLinkMethod.upload.protocol=STLink
F030F.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

F030F.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F030F.menu.upload_method.serialMethod.upload.protocol=maple_serial
F030F.menu.upload_method.serialMethod.upload.tool=serial_upload

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F030F.menu.log.default=Release(no-exceptions)
F030F.menu.log.default.build.log_level=-fno-exceptions
F030F.menu.log.Release=Release(exceptions)
F030F.menu.log.fatal=FATAL
F030F.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F030F.menu.log.error=ERROR
F030F.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F030F.menu.log.warning=WARNING
F030F.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F030F.menu.log.info=INFO
F030F.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F030F.menu.log.debug=DEBUG
F030F.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F030F.menu.log.trace=TRACE
F030F.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

####################################### F103x4/6#########################################
# f103x4/6 board
f103x6.name=F103R/C/T_4/6
f103x6.upload.uploadadr=0x08000000
f103x6.upload.vect=0x08000000
f103x6.serial.disableDTR=true
f103x6.serial.disableRTS=true

f103x6.build.mcu=cortex-m3
f103x6.build.board=F103x6
f103x6.build.core=arduino
f103x6.build.variant=BLUEPILL
f103x6.build.series=STM32F1
f103x6.build.f_cpu=72000000L

f103x6.menu.subboard.F103R6=F103R6[LED PC13]
f103x6.menu.subboard.F103R6.upload.maximum_size=32768
f103x6.menu.subboard.F103R6.upload.maximum_data_size=10240
f103x6.menu.subboard.F103R6.upload.device=STM32F103R6
f103x6.menu.subboard.F103R6.build.variant=F103R
f103x6.menu.subboard.F103R6.build.extra_flags=-DSTM32F103R6
f103x6.menu.subboard.F103R6.build.ldscript=ld/f103x6.ld
f103x6.menu.subboard.F103R6.build.board=F103R6

f103x6.menu.subboard.F103R4=F103R4[LED PB8]
f103x6.menu.subboard.F103R4.upload.maximum_size=16384
f103x6.menu.subboard.F103R4.upload.maximum_data_size=6144
f103x6.menu.subboard.F103R4.upload.device=STM32F103R4
f103x6.menu.subboard.F103R4.build.variant=F103R
f103x6.menu.subboard.F103R4.build.extra_flags=-DSTM32F103R4 -DLED_BUILTIN=PB8
f103x6.menu.subboard.F103R4.build.ldscript=ld/f103x4.ld
f103x6.menu.subboard.F103R4.build.board=F103R4

f103x6.menu.subboard.F103C6=F103C6[LED PC13]
f103x6.menu.subboard.F103C6.upload.maximum_size=32768
f103x6.menu.subboard.F103C6.upload.maximum_data_size=10240
f103x6.menu.subboard.F103C6.upload.device=STM32F103C6
f103x6.menu.subboard.F103C6.build.extra_flags=-DSTM32F103C6
f103x6.menu.subboard.F103C6.build.ldscript=ld/f103x6.ld
f103x6.menu.subboard.F103C6.build.board=F103C6

