tony-cloud/STM32_duino/boards.txt
f103x6.menu.subboard.F103C4=F103C4[LED PB8]
f103x6.menu.subboard.F103C4.upload.maximum_size=16384
f103x6.menu.subboard.F103C4.upload.maximum_data_size=6144
f103x6.menu.subboard.F103C4.upload.device=STM32F103C4
f103x6.menu.subboard.F103C4.build.extra_flags=-DSTM32F103C4 -DLED_BUILTIN=PB8
f103x6.menu.subboard.F103C4.build.ldscript=ld/f103x4.ld
f103x6.menu.subboard.F103C4.build.board=F103C4

f103x6.menu.subboard.F103T6=F103T6[LED PB7]
f103x6.menu.subboard.F103T6.upload.maximum_size=32768
f103x6.menu.subboard.F103T6.upload.maximum_data_size=10240
f103x6.menu.subboard.F103T6.upload.device=STM32F103T6
f103x6.menu.subboard.F103T6.build.extra_flags=-DSTM32F103T6 -DLED_BUILTIN=PB7
f103x6.menu.subboard.F103T6.build.ldscript=ld/f103x6.ld
f103x6.menu.subboard.F103T6.build.board=F103T6

f103x6.menu.subboard.F103T4=F103T4[LED PB7]
f103x6.menu.subboard.F103T4.upload.maximum_size=16384
f103x6.menu.subboard.F103T4.upload.maximum_data_size=6144
f103x6.menu.subboard.F103T4.upload.device=STM32F103T4
f103x6.menu.subboard.F103T4.build.extra_flags=-DSTM32F103T4 -DLED_BUILTIN=PB7
f103x6.menu.subboard.F103T4.build.ldscript=ld/f103x4.ld
f103x6.menu.subboard.F103T4.build.board=F103T4

f103x6.menu.osc_speed.speed_hsi8=8M(HSI)_8M(for proteus)
f103x6.menu.osc_speed.speed_hsi8.build.f_cpu=8000000L -DUSE_HSI -DPROTEUS
f103x6.menu.osc_speed.speed_hsi48=8M(HSI)_48M
f103x6.menu.osc_speed.speed_hsi48.build.f_cpu=48000000L -DUSE_HSI
f103x6.menu.osc_speed.speed_08m=8M(HSE)_72M
f103x6.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000

#---------------------------- UPLOAD METHODS ---------------------------
f103x6.menu.upload_method.STLinkMethod=STLink
f103x6.menu.upload_method.STLinkMethod.upload.protocol=STLink
f103x6.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
f103x6.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

f103x6.menu.upload_method.jLinkMethod=JLink
f103x6.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
f103x6.menu.upload_method.jLinkMethod.upload.protocol=jlink
f103x6.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

f103x6.menu.upload_method.serialMethod=SerialUART1 [TX/PA9, RX/PA10, BOOT0=1]
f103x6.menu.upload_method.serialMethod.upload.protocol=maple_serial
f103x6.menu.upload_method.serialMethod.upload.tool=serial_upload
f103x6.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

f103x6.menu.upload_method.BMPMethod=BMP
f103x6.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
f103x6.menu.upload_method.BMPMethod.upload.tool=bmp_upload
f103x6.menu.upload_method.BMPMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

f103x6.menu.usb.Disabled=Disabled USB
f103x6.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
f103x6.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL

f103x6.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
f103x6.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
f103x6.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
f103x6.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
f103x6.menu.serial.SerialUSB=SerialUSB
f103x6.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

f103x6.menu.jtag_swd.JTAG=JTAG [reserved: PA13, PA14, PA15, PB3, PB4]
f103x6.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
f103x6.menu.jtag_swd.SWD=SWD [debug pins reserved: PA13, PA14]
f103x6.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
f103x6.menu.jtag_swd.Disabled=Disabled [debug pins free]
f103x6.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
f103x6.menu.log.default=Release(no-exceptions)
f103x6.menu.log.default.build.log_level=-fno-exceptions
f103x6.menu.log.Release=Release(exceptions)
f103x6.menu.log.fatal=FATAL
f103x6.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
f103x6.menu.log.error=ERROR
f103x6.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
f103x6.menu.log.warning=WARNING
f103x6.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
f103x6.menu.log.info=INFO
f103x6.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
f103x6.menu.log.debug=DEBUG
f103x6.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
f103x6.menu.log.trace=TRACE
f103x6.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

####################################MapleMini_F103C board############################################
MapleMini.name=MapleMini F103C8/B

MapleMini.upload.uploadadr=0x08000000
MapleMini.upload.vect=0x08000000
MapleMini.serial.disableDTR=true
MapleMini.serial.disableRTS=true

MapleMini.build.mcu=cortex-m3
MapleMini.build.core=arduino
MapleMini.build.board=MAPLE_MINI
MapleMini.build.variant=MAPLE_MINI
MapleMini.build.series=STM32F1

MapleMini.menu.subboard.F103CB=MapleMini F103C8/B[LED PB1/SWD]
MapleMini.menu.subboard.F103CB.upload.maximum_size=131072
MapleMini.menu.subboard.F103CB.upload.maximum_data_size=20480
MapleMini.menu.subboard.F103CB.build.extra_flags=-DSTM32F103CB
MapleMini.menu.subboard.F103CB.build.ldscript_pre=ld/f103xB
MapleMini.menu.subboard.F103CB.build.ldscript=ld/f103xB.ld
MapleMini.menu.subboard.F103CB.build.board=MAPLEMINI_F103CB

MapleMini.menu.clock_source.hse=8M(HSE)_72M
MapleMini.menu.clock_source.hse.build.f_cpu=72000000L -DHSE_VALUE=8000000

MapleMini.menu.clock_source.hsi=8M(HSI)_48M
MapleMini.menu.clock_source.hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
MapleMini.menu.upload_method.STLinkMethod=STLink [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.STLinkMethod.upload.protocol=STLink
MapleMini.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
MapleMini.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini.menu.upload_method.jLinkMethod=JLink [Automatic serial=SerialUSB]
MapleMini.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
MapleMini.menu.upload_method.jLinkMethod.upload.protocol=jlink
MapleMini.menu.upload_method.jLinkMethod.upload.device=STM32F103C8

MapleMini.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10,BOOT0(button)=1(press when reset)]
MapleMini.menu.upload_method.serialMethod.upload.protocol=maple_serial
MapleMini.menu.upload_method.serialMethod.upload.tool=serial_upload
MapleMini.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

MapleMini.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
MapleMini.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
MapleMini.menu.upload_method.BMPMethod.upload.tool=bmp_upload

MapleMini.menu.upload_method.DFUUploadMethod2=USB DFU - STM32duino bootloader (0x2000)
MapleMini.menu.upload_method.DFUUploadMethod2.upload.protocol=maple_dfu
MapleMini.menu.upload_method.DFUUploadMethod2.upload.tool=maple_upload
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000 -DUSB_DISC_PIN=PB9
MapleMini.menu.upload_method.DFUUploadMethod2.build.ldscript={build.ldscript_pre}_bootloader_2000.ld
MapleMini.menu.upload_method.DFUUploadMethod2.upload.usbID=1EAF:0003
MapleMini.menu.upload_method.DFUUploadMethod2.upload.altID=UNUSED
MapleMini.menu.upload_method.DFUUploadMethod2.maximum_data_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.flash.maximum_size=122880
MapleMini.menu.upload_method.DFUUploadMethod2.ram.maximum_size=20480
MapleMini.menu.upload_method.DFUUploadMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

