tony-cloud/STM32_duino/boards.txt
BluePill.menu.startadr.R20000000=Sram 0:0x20000000(16K+4K BOOT=11 St/Jlink uploader only)
BluePill.menu.startadr.R20000000.upload.maximum_size=16384
BluePill.menu.startadr.R20000000.upload.maximum_data_size=4096
BluePill.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
BluePill.menu.startadr.R20000000.build.ldscript=ld/f103xB_RAM0.ld
BluePill.menu.startadr.R20000000.upload.uploadadr=0x20000000
BluePill.menu.startadr.R20000000.upload.vect=0x20000000

BluePill.menu.osc_speed.speed_08m=8M(HSE)_72M
BluePill.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
BluePill.menu.osc_speed.speed_hsi=8M(HSI)_48M
BluePill.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
BluePill.menu.upload_method.STLinkMethod=STLink
BluePill.menu.upload_method.STLinkMethod.upload.protocol=STLink
BluePill.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
BluePill.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.upload_method.jLinkMethod=JLink
BluePill.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
BluePill.menu.upload_method.jLinkMethod.upload.protocol=jlink
BluePill.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.upload_method.serialMethod=SerialUART1 [TX/PA9, RX/PA10, BOOT0=1]
BluePill.menu.upload_method.serialMethod.upload.protocol=maple_serial
BluePill.menu.upload_method.serialMethod.upload.tool=serial_upload
BluePill.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

BluePill.menu.upload_method.BMPMethod=BMP
BluePill.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
BluePill.menu.upload_method.BMPMethod.upload.tool=bmp_upload
BluePill.menu.upload_method.BMPMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

BluePill.menu.usb.Disabled=Disabled USB
BluePill.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
BluePill.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
BluePill.menu.usb.SerialMSC=Mass storage
BluePill.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
BluePill.menu.usb.Composite=Composite[CDC+MSC]
BluePill.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

BluePill.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
BluePill.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
BluePill.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
BluePill.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
BluePill.menu.serial.SerialUSB=SerialUSB
BluePill.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#BluePill.menu.jtag_swd.default=Debug_default
BluePill.menu.jtag_swd.JTAG=JTAG [reserved: PA13, PA14, PA15, PB3, PB4]
BluePill.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
BluePill.menu.jtag_swd.SWD=SWD [debug pins reserved: PA13, PA14]
BluePill.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
BluePill.menu.jtag_swd.Disabled=Disabled [debug pins free]
BluePill.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
BluePill.menu.log.default=Release(no-exceptions)
BluePill.menu.log.default.build.log_level=-fno-exceptions
BluePill.menu.log.Release=Release(exceptions)
BluePill.menu.log.fatal=FATAL
BluePill.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
BluePill.menu.log.error=ERROR
BluePill.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
BluePill.menu.log.warning=WARNING
BluePill.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
BluePill.menu.log.info=INFO
BluePill.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
BluePill.menu.log.debug=DEBUG
BluePill.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
BluePill.menu.log.trace=TRACE
BluePill.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

##################################### L152C ###########################################
# L152C board(32M)
L152C.name=L152Cx(32M)
L152C.serial.disableDTR=true
L152C.serial.disableRTS=true

L152C.build.core=arduino
L152C.build.board=L152C

L152C.build.mcu=cortex-m3
L152C.build.series=STM32L1

L152C.menu.subboard.L152CB=L152CB
L152C.menu.subboard.L152CB.upload.maximum_size=131072
L152C.menu.subboard.L152CB.upload.maximum_data_size=16384
L152C.menu.subboard.L152CB.build.variant=L152C
L152C.menu.subboard.L152CB.build.extra_flags=-DSTM32L152CB
L152C.menu.subboard.L152CB.build.ldscript=ld/l152cb.ld

L152C.menu.subboard.L152C8=L152C8
L152C.menu.subboard.L152C8.upload.maximum_size=65536
L152C.menu.subboard.L152C8.upload.maximum_data_size=10240
L152C.menu.subboard.L152C8.build.variant=L152C
L152C.menu.subboard.L152C8.build.extra_flags=-DSTM32L152C8
L152C.menu.subboard.L152C8.build.ldscript=ld/l152c8.ld

L152C.build.f_cpupre=32000000L

L152C.menu.clock_source.hse8m=HSE(8M)
L152C.menu.clock_source.hse8m.build.f_cpu={build.f_cpupre} -DUSE_HSE -DHSE_VALUE=8000000

L152C.menu.clock_source.hsi=HSI
L152C.menu.clock_source.hsi.build.f_cpu={build.f_cpupre} -DUSE_HSI

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
L152C.menu.upload_method.STLinkMethod=STLink
L152C.menu.upload_method.STLinkMethod.upload.protocol=STLink
L152C.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

L152C.menu.upload_method.MassStorageMethod=Mass Storage
L152C.menu.upload_method.MassStorageMethod.upload.protocol=
L152C.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
L152C.menu.upload_method.MassStorageMethod.massstorage_drive=DISCOVERY

L152C.menu.usb.Disabled=Disabled USB
L152C.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
L152C.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
L152C.menu.usb.SerialMSC=Mass storage
L152C.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
L152C.menu.usb.Composite=Composite[CDC+MSC]
L152C.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

L152C.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/10]
L152C.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
L152C.menu.serial.SerialUSB=SerialUSB (USB connector)
L152C.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

