tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
L152C.menu.log.default=Release(no-exceptions)
L152C.menu.log.default.build.log_level=-fno-exceptions
L152C.menu.log.Release=Release(exceptions)
L152C.menu.log.fatal=FATAL
L152C.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
L152C.menu.log.error=ERROR
L152C.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
L152C.menu.log.warning=WARNING
L152C.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
L152C.menu.log.info=INFO
L152C.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
L152C.menu.log.debug=DEBUG
L152C.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
L152C.menu.log.trace=TRACE
L152C.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### GD103RB #######################################
GD103RB.name=GD32F103RB
GD103RB.vid.0=0x067B
GD103RB.pid.0=0x2303

GD103RB.serial.disableDTR=true
GD103RB.serial.disableRTS=true
GD103RB.upload.uploadadr=0x08000000
GD103RB.upload.vect=0x08000000

GD103RB.build.board=F103R
GD103RB.build.core=arduino
GD103RB.build.series=STM32F1
GD103RB.build.mcu=cortex-m3

GD103RB.menu.subboard.F103RB=ALIENTEK_MINI[F103RB]
GD103RB.menu.subboard.F103RB.upload.maximum_size=131072
GD103RB.menu.subboard.F103RB.upload.maximum_data_size=20480
GD103RB.menu.subboard.F103RB.upload.device=STM32F103RB
GD103RB.menu.subboard.F103RB.build.extra_flags0=-DSTM32F103RB
GD103RB.menu.subboard.F103RB.build.variant=ATKMINI_F103R
GD103RB.menu.subboard.F103RB.build.board=ATKMINI_F103RB
GD103RB.menu.subboard.F103RB.build.ldscript=ld/f103xB.ld
GD103RB.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103RB.menu.subboard.F103RB.massstorage_drive=NUCLEO

GD103RB.menu.subboard.F103RB1=GENERIC_F103RB[LED PC13]
GD103RB.menu.subboard.F103RB1.upload.maximum_size=131072
GD103RB.menu.subboard.F103RB1.upload.maximum_data_size=20480
GD103RB.menu.subboard.F103RB1.upload.device=STM32F103RB
GD103RB.menu.subboard.F103RB1.build.extra_flags0=-DSTM32F103RB
GD103RB.menu.subboard.F103RB1.build.variant=F103R_GD
GD103RB.menu.subboard.F103RB1.build.board=GENERIC_F103RB
GD103RB.menu.subboard.F103RB1.build.ldscript=ld/f103xB.ld
GD103RB.menu.subboard.F103RB1.massstorage_drive=NUCLEO

GD103RB.menu.startadr.default=flash(128k+20k)
GD103RB.menu.startadr.default.build.extra_flags={build.extra_flags0}

GD103RB.menu.startadr.F08004000=flash 1:0x08004000(32k)
GD103RB.menu.startadr.F08004000.upload.maximum_size=32768
GD103RB.menu.startadr.F08004000.upload.maximum_data_size=20480
GD103RB.menu.startadr.F08004000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x04000
GD103RB.menu.startadr.F08004000.build.ldscript=ld/f103xB_08004.ld
GD103RB.menu.startadr.F08004000.upload.uploadadr=0x0800400
GD103RB.menu.startadr.F08004000.upload.vect=0x0800400

GD103RB.menu.startadr.F0800C000=flash 2:0x0800C000(32k) 
GD103RB.menu.startadr.F0800C000.upload.maximum_size=32768
GD103RB.menu.startadr.F0800C000.upload.maximum_data_size=20480
GD103RB.menu.startadr.F0800C000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xc000
GD103RB.menu.startadr.F0800C000.build.ldscript=ld/f103xB_0800c.ld
GD103RB.menu.startadr.F0800C000.upload.uploadadr=0x0800c000
GD103RB.menu.startadr.F0800C000.upload.vect=0x0800c000

GD103RB.menu.startadr.F08014000=flash 3:0x08014000(48k)
GD103RB.menu.startadr.F08014000.upload.maximum_size=49152
GD103RB.menu.startadr.F08014000.upload.maximum_data_size=20480
GD103RB.menu.startadr.F08014000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x14000
GD103RB.menu.startadr.F08014000.build.ldscript=ld/f103xB_08014.ld
GD103RB.menu.startadr.F08014000.upload.uploadadr=0x08014000
GD103RB.menu.startadr.F08014000.upload.vect=0x08014000

GD103RB.menu.startadr.F08000000=flash(WithRamBoot 16kflash + 4kRAM used Only)
GD103RB.menu.startadr.F08000000.upload.maximum_size=16384
GD103RB.menu.startadr.F08000000.upload.maximum_data_size=4096
GD103RB.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
GD103RB.menu.startadr.F08000000.build.ldscript=ld/f103xB_0800.ld
GD103RB.menu.startadr.F08000000.upload.uploadadr=0x08000000
GD103RB.menu.startadr.F08000000.upload.vect=0x08000000

GD103RB.menu.startadr.R20000000=Sram 0:0x20000000(16K+4K BOOT=11 St/Jlink uploader only)
GD103RB.menu.startadr.R20000000.upload.maximum_size=16384
GD103RB.menu.startadr.R20000000.upload.maximum_data_size=4096
GD103RB.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
GD103RB.menu.startadr.R20000000.build.ldscript=ld/f103xB_RAM0.ld
GD103RB.menu.startadr.R20000000.upload.uploadadr=0x20000000
GD103RB.menu.startadr.R20000000.upload.vect=0x20000000

GD103RB.menu.extern_lib.NONE=NONE
GD103RB.menu.extern_lib.STemWin=STemWin
GD103RB.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
GD103RB.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
GD103RB.menu.extern_lib.STemWinOS=STemWin_OS
GD103RB.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
GD103RB.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

GD103RB.menu.osc_speed.speed_08m=8M (HSE)
GD103RB.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103RB.menu.osc_speed.speed_12m=12M (HSE)
GD103RB.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103RB.menu.osc_speed.speed_hsi=8M (HSI)
GD103RB.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

GD103RB.menu.cpu_speed.F120=120M(overdrive)
GD103RB.menu.cpu_speed.F120.build.f_cpu=120000000L -DGD32F10X {build.osc}

GD103RB.menu.cpu_speed.F96=96M(Stable)
GD103RB.menu.cpu_speed.F96.build.f_cpu=96000000L -DGD32F10X {build.osc}

GD103RB.menu.cpu_speed.F72=72M(compatible with STM)
GD103RB.menu.cpu_speed.F72.build.f_cpu=72000000L -DGD32F10X {build.osc}

#---------------------------- UPLOAD METHODS ---------------------------
GD103RB.menu.upload_method.jLinkMethod=JLink
GD103RB.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
GD103RB.menu.upload_method.jLinkMethod.upload.protocol=jlink
GD103RB.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

