tony-cloud/STM32_duino/boards.txt
F103RB.menu.startadr.F0800C000=flash 2:0x0800C000(32k) 
F103RB.menu.startadr.F0800C000.upload.maximum_size=65525
F103RB.menu.startadr.F0800C000.upload.maximum_data_size=20480
F103RB.menu.startadr.F0800C000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0C000
F103RB.menu.startadr.F0800C000.build.ldscript=ld/f103xB_0800c.ld
F103RB.menu.startadr.F0800C000.upload.uploadadr=0x0800C000
F103RB.menu.startadr.F0800C000.upload.vect=0x0800C000

F103RB.menu.startadr.F08014000=flash 3:0x08014000(48k)
F103RB.menu.startadr.F08014000.upload.maximum_size=49152
F103RB.menu.startadr.F08014000.upload.maximum_data_size=20480
F103RB.menu.startadr.F08014000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x14000
F103RB.menu.startadr.F08014000.build.ldscript=ld/f103xB_08014.ld
F103RB.menu.startadr.F08014000.upload.uploadadr=0x08014000
F103RB.menu.startadr.F08014000.upload.vect=0x08014000

F103RB.menu.startadr.F08000000=flash(WithRamBoot 16kflash + 4kRAM used Only)
F103RB.menu.startadr.F08000000.upload.maximum_size=16384
F103RB.menu.startadr.F08000000.upload.maximum_data_size=4096
F103RB.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F103RB.menu.startadr.F08000000.build.ldscript=ld/f103xB_0800.ld
F103RB.menu.startadr.F08000000.upload.uploadadr=0x08000000
F103RB.menu.startadr.F08000000.upload.vect=0x08000000

F103RB.menu.startadr.R20000000=Sram 0:0x20000000(16K+4K BOOT=11 St/Jlink uploader only)
F103RB.menu.startadr.R20000000.upload.maximum_size=16384
F103RB.menu.startadr.R20000000.upload.maximum_data_size=4096
F103RB.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103RB.menu.startadr.R20000000.build.ldscript=ld/f103xB_RAM0.ld
F103RB.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103RB.menu.startadr.R20000000.upload.vect=0x20000000

F103RB.menu.extern_lib.NONE=NONE
F103RB.menu.extern_lib.STemWin=STemWin
F103RB.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103RB.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103RB.menu.extern_lib.STemWinOS=STemWin_OS
F103RB.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103RB.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

F103RB.menu.osc_speed.speed_08m=8M(HSE)_72M
F103RB.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103RB.menu.osc_speed.speed_hsi=8M(HSI)_48M
F103RB.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103RB.menu.upload_method.jLinkMethod=JLink
F103RB.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103RB.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103RB.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103RB.menu.upload_method.STLinkMethod=STLink 
F103RB.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103RB.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103RB.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103RB.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F103RB.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103RB.menu.upload_method.serialMethod.upload.tool=serial_upload
F103RB.menu.upload_method.serialMethod.upload.altID=UNUSED
F103RB.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RB.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103RB.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103RB.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103RB.menu.upload_method.serialMethod1.upload.altID=PL2303
F103RB.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RB.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103RB.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103RB.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103RB.menu.upload_method.serialMethod2.upload.altID=CH340
F103RB.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RB.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103RB.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103RB.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103RB.menu.usb.Disabled=Disabled USB
F103RB.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103RB.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103RB.menu.usb.SerialMSC=Mass storage
F103RB.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103RB.menu.usb.Composite=Composite[CDC+MSC]
F103RB.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103RB.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
F103RB.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103RB.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
F103RB.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103RB.menu.serial.SerialUSB=SerialUSB
F103RB.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#F103RB.menu.jtag_swd.default=Debug_default
F103RB.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103RB.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103RB.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103RB.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103RB.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103RB.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F103RB.menu.log.default=Release(no-exceptions)
F103RB.menu.log.default.build.log_level=-fno-exceptions
F103RB.menu.log.Release=Release(exceptions)
F103RB.menu.log.fatal=FATAL
F103RB.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F103RB.menu.log.error=ERROR
F103RB.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F103RB.menu.log.warning=WARNING
F103RB.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F103RB.menu.log.info=INFO
F103RB.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F103RB.menu.log.debug=DEBUG
F103RB.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F103RB.menu.log.trace=TRACE
F103RB.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT


######################################F103RE#######################################
F103RE.name=F103RC/D/E(72M)
F103RE.vid.0=0x067B
F103RE.pid.0=0x2303

F103RE.serial.disableDTR=true
F103RE.serial.disableRTS=true
F103RE.upload.uploadadr=0x08000000
F103RE.upload.vect=0x08000000

F103RE.build.board=F103R
F103RE.build.core=arduino
F103RE.build.series=STM32F1
F103RE.build.mcu=cortex-m3

