tony-cloud/STM32_duino/boards.txt
F103RE.menu.subboard.F103RE=ALIENTEK_MINI[F103RC/D/E]
F103RE.menu.subboard.F103RE.upload.maximum_size=524288
F103RE.menu.subboard.F103RE.upload.maximum_data_size=65536
F103RE.menu.subboard.F103RE.upload.device=STM32F103RE
F103RE.menu.subboard.F103RE.build.extra_flags0=-DSTM32F103RE
F103RE.menu.subboard.F103RE.build.variant=ATKMINI_F103R
F103RE.menu.subboard.F103RE.build.board=ATKMINI_F103RE
F103RE.menu.subboard.F103RE.build.ldscript=ld/f103xE.ld
F103RE.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD

F103RE.menu.subboard.F103RE1=GENERIC_F103RC/D/E[LED PC13]
F103RE.menu.subboard.F103RE1.upload.maximum_size=524288
F103RE.menu.subboard.F103RE1.upload.maximum_data_size=65536
F103RE.menu.subboard.F103RE1.upload.device=STM32F103RE
F103RE.menu.subboard.F103RE1.build.extra_flags0=-DSTM32F103RE
F103RE.menu.subboard.F103RE1.build.variant=F103R
F103RE.menu.subboard.F103RE1.build.board=GENERIC_F103RE
F103RE.menu.subboard.F103RE1.build.ldscript=ld/f103xE.ld

F103RE.menu.startadr.default=flash(512k+64k)
F103RE.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103RE.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103RE.menu.startadr.F08010000.upload.maximum_size=65536
F103RE.menu.startadr.F08010000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103RE.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103RE.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103RE.menu.startadr.F08010000.upload.vect=0x08010000

F103RE.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103RE.menu.startadr.F08020000.upload.maximum_size=65536
F103RE.menu.startadr.F08020000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103RE.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103RE.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103RE.menu.startadr.F08020000.upload.vect=0x08020000

F103RE.menu.startadr.F08030000=flash 3:0x08030000(64k)
F103RE.menu.startadr.F08030000.upload.maximum_size=65536
F103RE.menu.startadr.F08030000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F103RE.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
F103RE.menu.startadr.F08030000.upload.uploadadr=0x08030000
F103RE.menu.startadr.F08030000.upload.vect=0x08030000

F103RE.menu.startadr.F08040000=flash 4:0x08040000(64k)
F103RE.menu.startadr.F08040000.upload.maximum_size=65536
F103RE.menu.startadr.F08040000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F103RE.menu.startadr.F08040000.build.ldscript=ld/f103xE_0804.ld
F103RE.menu.startadr.F08040000.upload.uploadadr=0x08040000
F103RE.menu.startadr.F08040000.upload.vect=0x08040000

F103RE.menu.startadr.F08050000=flash 5:0x08050000(64k)
F103RE.menu.startadr.F08050000.upload.maximum_size=65536
F103RE.menu.startadr.F08050000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08050000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x50000
F103RE.menu.startadr.F08050000.build.ldscript=ld/f103xE_0805.ld
F103RE.menu.startadr.F08050000.upload.uploadadr=0x08050000
F103RE.menu.startadr.F08050000.upload.vect=0x08050000

F103RE.menu.startadr.F08060000=flash 6:0x08060000(64k)
F103RE.menu.startadr.F08060000.upload.maximum_size=65536
F103RE.menu.startadr.F08060000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
F103RE.menu.startadr.F08060000.build.ldscript=ld/f103xE_0806.ld
F103RE.menu.startadr.F08060000.upload.uploadadr=0x08060000
F103RE.menu.startadr.F08060000.upload.vect=0x08060000

F103RE.menu.startadr.F08070000=flash 7:0x08070000(64k)
F103RE.menu.startadr.F08070000.upload.maximum_size=65536
F103RE.menu.startadr.F08070000.upload.maximum_data_size=65536
F103RE.menu.startadr.F08070000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x70000
F103RE.menu.startadr.F08070000.build.ldscript=ld/f103xE_0807.ld
F103RE.menu.startadr.F08070000.upload.uploadadr=0x08070000
F103RE.menu.startadr.F08070000.upload.vect=0x08070000

F103RE.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F103RE.menu.startadr.F08000000.upload.maximum_size=65536
F103RE.menu.startadr.F08000000.upload.maximum_data_size=20480
F103RE.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F103RE.menu.startadr.F08000000.build.ldscript=ld/f103xE_0800.ld
F103RE.menu.startadr.F08000000.upload.uploadadr=0x08000000
F103RE.menu.startadr.F08000000.upload.vect=0x08000000

F103RE.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F103RE.menu.startadr.R20000000.upload.maximum_size=45056
F103RE.menu.startadr.R20000000.upload.maximum_data_size=20480
F103RE.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103RE.menu.startadr.R20000000.build.ldscript=ld/f103xE_RAM0.ld
F103RE.menu.startadr.R20000000.upload.uploadadr=0x20000000
F103RE.menu.startadr.R20000000.upload.vect=0x20000000

F103RE.menu.extern_lib.NONE=NONE
F103RE.menu.extern_lib.STemWin=STemWin
F103RE.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103RE.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103RE.menu.extern_lib.STemWinOS=STemWin_OS
F103RE.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103RE.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

F103RE.menu.osc_speed.speed_08m=8M(HSE)_72M
F103RE.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103RE.menu.osc_speed.speed_hsi=8M(HSI)_48M
F103RE.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103RE.menu.upload_method.jLinkMethod=JLink
F103RE.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103RE.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103RE.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103RE.menu.upload_method.STLinkMethod=STLink 
F103RE.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103RE.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103RE.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103RE.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F103RE.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod.upload.altID=UNUSED
F103RE.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103RE.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod1.upload.altID=PL2303
F103RE.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103RE.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103RE.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103RE.menu.upload_method.serialMethod2.upload.altID=CH340
F103RE.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103RE.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103RE.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103RE.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103RE.menu.usb.Disabled=Disabled USB
F103RE.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103RE.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103RE.menu.usb.SerialMSC=Mass storage
F103RE.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103RE.menu.usb.Composite=Composite[CDC+MSC]
F103RE.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103RE.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
F103RE.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103RE.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
F103RE.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103RE.menu.serial.SerialUSB=SerialUSB
F103RE.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#F103RE.menu.jtag_swd.default=Debug_default
F103RE.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103RE.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103RE.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103RE.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103RE.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103RE.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

