tony-cloud/STM32_duino/boards.txt
F107V.menu.startadr.default=flash(256k+64k)
F107V.menu.startadr.default.build.extra_flags={build.extra_flags0}

F107V.menu.startadr.F08010000=flash 1:0x08010000(64k)
F107V.menu.startadr.F08010000.upload.maximum_size=65536
F107V.menu.startadr.F08010000.upload.maximum_data_size=65536
F107V.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F107V.menu.startadr.F08010000.build.ldscript=ld/f107xC_0801.ld
F107V.menu.startadr.F08010000.upload.uploadadr=0x08010000
F107V.menu.startadr.F08010000.upload.vect=0x08010000

F107V.menu.startadr.F08020000=flash 2:0x08020000(64k)
F107V.menu.startadr.F08020000.upload.maximum_size=65536
F107V.menu.startadr.F08020000.upload.maximum_data_size=65536
F107V.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F107V.menu.startadr.F08020000.build.ldscript=ld/f107xC_0802.ld
F107V.menu.startadr.F08020000.upload.uploadadr=0x08020000
F107V.menu.startadr.F08020000.upload.vect=0x08020000

F107V.menu.startadr.F08030000=flash 3:0x08030000(64k)
F107V.menu.startadr.F08030000.upload.maximum_size=65536
F107V.menu.startadr.F08030000.upload.maximum_data_size=65536
F107V.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F107V.menu.startadr.F08030000.build.ldscript=ld/f107xC_0803.ld
F107V.menu.startadr.F08030000.upload.uploadadr=0x08030000
F107V.menu.startadr.F08030000.upload.vect=0x08030000

F107V.menu.startadr.F08040000=flash 4:0x08040000(64k)
F107V.menu.startadr.F08040000.upload.maximum_size=65536
F107V.menu.startadr.F08040000.upload.maximum_data_size=65536
F107V.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F107V.menu.startadr.F08040000.build.ldscript=ld/f107xC_0804.ld
F107V.menu.startadr.F08040000.upload.uploadadr=0x08040000
F107V.menu.startadr.F08040000.upload.vect=0x08040000

F107V.menu.startadr.F08000000=flash(WithRamBoot 20kRAM used Only)
F107V.menu.startadr.F08000000.upload.maximum_size=65536
F107V.menu.startadr.F08000000.upload.maximum_data_size=20480
F107V.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F107V.menu.startadr.F08000000.build.ldscript=ld/f107xC_0800.ld
F107V.menu.startadr.F08000000.upload.uploadadr=0x08000000
F107V.menu.startadr.F08000000.upload.vect=0x08000000

F107V.menu.startadr.R20000000=Sram 0:0x20000000(44K+20K BOOT=11 St/Jlink uploader only)
F107V.menu.startadr.R20000000.upload.maximum_size=45056
F107V.menu.startadr.R20000000.upload.maximum_data_size=20480
F107V.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F107V.menu.startadr.R20000000.build.ldscript=ld/f107xC_RAM0.ld
F107V.menu.startadr.R20000000.upload.uploadadr=0x20000000
F107V.menu.startadr.R20000000.upload.vect=0x20000000

F107V.menu.extern_lib.NONE=NONE
F107V.menu.extern_lib.STemWin=STemWin
F107V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F107V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F107V.menu.extern_lib.STemWinOS=STemWin_OS
F107V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F107V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F107V.menu.upload_method.STLinkMethod=STLink
F107V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F107V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F107V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F107V.menu.upload_method.jLinkMethod=JLink
F107V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F107V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F107V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F107V.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F107V.menu.upload_method.MassStorageMethod.upload.protocol=
F107V.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F107V.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F107V.menu.upload_method.serialMethod.upload.protocol=maple_serial
F107V.menu.upload_method.serialMethod.upload.tool=serial_upload
F107V.menu.upload_method.serialMethod.upload.altID=UNUSED
F107V.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F107V.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F107V.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F107V.menu.upload_method.serialMethod1.upload.tool=serial_upload
F107V.menu.upload_method.serialMethod1.upload.altID=PL2303
F107V.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F107V.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F107V.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F107V.menu.upload_method.serialMethod2.upload.tool=serial_upload
F107V.menu.upload_method.serialMethod2.upload.altID=CH340
F107V.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F107V.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F107V.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F107V.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F107V.menu.usb.Disabled=Disabled USB
F107V.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
F107V.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F107V.menu.usb.SerialMSC=Mass storage
F107V.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F107V.menu.usb.Composite=Composite[CDC+MSC]
F107V.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F107V.menu.serial.SerialUART1=SerialUART1[PA9/PA10]
F107V.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F107V.menu.serial.SerialUART2=SerialUART2[PA2/PA3]
F107V.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F107V.menu.serial.SerialUSB=SerialUSB
F107V.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F107V.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4, PB3,PA15,PA14,PA13]
F107V.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F107V.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F107V.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F107V.menu.jtag_swd.Disabled=Disabled [debug pins free]
F107V.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

