tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F107V.menu.log.default=Release(no-exceptions)
F107V.menu.log.default.build.log_level=-fno-exceptions
F107V.menu.log.Release=Release(exceptions)
F107V.menu.log.fatal=FATAL
F107V.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F107V.menu.log.error=ERROR
F107V.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F107V.menu.log.warning=WARNING
F107V.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F107V.menu.log.info=INFO
F107V.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F107V.menu.log.debug=DEBUG
F107V.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F107V.menu.log.trace=TRACE
F107V.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### F103Z ##########################################
F103Z.name=F103ZC/D/E(72M)

F103Z.serial.disableDTR=true
F103Z.serial.disableRTS=true
F103Z.upload.uploadadr=0x08000000
F103Z.upload.vect=0x08000000

F103Z.build.mcu=cortex-m3
F103Z.build.board=F103Z
F103Z.build.core=arduino
F103Z.build.series=STM32F1
F103Z.build.f_cpu=72000000L

F103Z.menu.subboard.F103ZE1=HY_RedBull_V2[F103ZC/D/E]
F103Z.menu.subboard.F103ZE1.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE1.upload.maximum_data_size=524288
F103Z.menu.subboard.F103ZE1.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE1.build.variant=REDBULL_V2_F103ZE
F103Z.menu.subboard.F103ZE1.build.board=REDBULL
F103Z.menu.subboard.F103ZE1.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE1.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.F103ZE1.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE1.upload.protocol=jlink
F103Z.menu.subboard.F103ZE1.upload.tool=jlink_upload
F103Z.menu.subboard.F103ZE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


F103Z.menu.subboard.F103ZE2=HASEE_V3[F103ZC/D/E]
F103Z.menu.subboard.F103ZE2.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE2.upload.maximum_data_size=65536
F103Z.menu.subboard.F103ZE2.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE2.build.variant=HASEE_III_F103ZE
F103Z.menu.subboard.F103ZE2.build.board=HASEE_V3
F103Z.menu.subboard.F103ZE2.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE2.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.F103ZE2.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE2.upload.protocol=STLink
F103Z.menu.subboard.F103ZE2.upload.tool=stlink_upload
F103Z.menu.subboard.F103ZE2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


F103Z.menu.subboard.DOFLYE=DOFLYE_M3S[F103ZC/D/E CH340]
F103Z.menu.subboard.DOFLYE.upload.maximum_size=524288
F103Z.menu.subboard.DOFLYE.upload.maximum_data_size=65536
F103Z.menu.subboard.DOFLYE.upload.device=STM32F103ZE
F103Z.menu.subboard.DOFLYE.build.variant=DOFLYE_M3S_F103ZE
F103Z.menu.subboard.DOFLYE.build.board=DOFLYE_M3S
F103Z.menu.subboard.DOFLYE.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.DOFLYE.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.DOFLYE.massstorage_drive=NUCLEO
F103Z.menu.subboard.DOFLYE.upload.protocol=maple_serial
F103Z.menu.subboard.DOFLYE.upload.tool=serial_upload
F103Z.menu.subboard.DOFLYE.upload.altID=CH340
F103Z.menu.subboard.DOFLYE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.subboard.BITV30=BIT_V30[F103ZC/D/E CH340]
F103Z.menu.subboard.BITV30.upload.maximum_size=524288
F103Z.menu.subboard.BITV30.upload.maximum_data_size=65536
F103Z.menu.subboard.BITV30.upload.device=STM32F103ZE
F103Z.menu.subboard.BITV30.build.variant=BIT_V30_F103ZE
F103Z.menu.subboard.BITV30.build.board=BIT_V30
F103Z.menu.subboard.BITV30.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.BITV30.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.BITV30.massstorage_drive=NUCLEO
F103Z.menu.subboard.BITV30.upload.protocol=maple_serial
F103Z.menu.subboard.BITV30.upload.tool=serial_upload
F103Z.menu.subboard.BITV30.upload.altID=CH340
F103Z.menu.subboard.BITV30.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.subboard.F103ZE=GENERIC_F103ZC/D/E
F103Z.menu.subboard.F103ZE.upload.maximum_size=524288
F103Z.menu.subboard.F103ZE.upload.maximum_data_size=65536
F103Z.menu.subboard.F103ZE.upload.device=STM32F103ZE
F103Z.menu.subboard.F103ZE.build.variant=F103Z
F103Z.menu.subboard.F103ZE.build.board=GENERIC_F103ZE
F103Z.menu.subboard.F103ZE.build.extra_flags0=-DSTM32F103ZE
F103Z.menu.subboard.F103ZE.build.ldscript=ld/f103xE.ld
F103Z.menu.subboard.F103ZE.massstorage_drive=NUCLEO
F103Z.menu.subboard.F103ZE.upload.protocol=STLink
F103Z.menu.subboard.F103ZE.upload.tool=stlink_upload
F103Z.menu.subboard.F103ZE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1


F103Z.menu.startadr.default=flash(512k+64k)
F103Z.menu.startadr.default.build.extra_flags={build.extra_flags0}

F103Z.menu.startadr.F08010000=flash 1:0x08010000(64k)
F103Z.menu.startadr.F08010000.upload.maximum_size=65536
F103Z.menu.startadr.F08010000.upload.maximum_data_size=65536
F103Z.menu.startadr.F08010000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x10000
F103Z.menu.startadr.F08010000.build.ldscript=ld/f103xE_0801.ld
F103Z.menu.startadr.F08010000.upload.uploadadr=0x08010000
F103Z.menu.startadr.F08010000.upload.vect=0x08010000

F103Z.menu.startadr.F08020000=flash 2:0x08020000(64k)
F103Z.menu.startadr.F08020000.upload.maximum_size=65536
F103Z.menu.startadr.F08020000.upload.maximum_data_size=65536
F103Z.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
F103Z.menu.startadr.F08020000.build.ldscript=ld/f103xE_0802.ld
F103Z.menu.startadr.F08020000.upload.uploadadr=0x08020000
F103Z.menu.startadr.F08020000.upload.vect=0x08020000

F103Z.menu.startadr.F08030000=flash 3:0x08030000(64k)
F103Z.menu.startadr.F08030000.upload.maximum_size=65536
F103Z.menu.startadr.F08030000.upload.maximum_data_size=65536
F103Z.menu.startadr.F08030000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x30000
F103Z.menu.startadr.F08030000.build.ldscript=ld/f103xE_0803.ld
F103Z.menu.startadr.F08030000.upload.uploadadr=0x08030000
F103Z.menu.startadr.F08030000.upload.vect=0x08030000

F103Z.menu.startadr.F08040000=flash 4:0x08040000(64k)
F103Z.menu.startadr.F08040000.upload.maximum_size=65536
F103Z.menu.startadr.F08040000.upload.maximum_data_size=65536
F103Z.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F103Z.menu.startadr.F08040000.build.ldscript=ld/f103xE_0804.ld
F103Z.menu.startadr.F08040000.upload.uploadadr=0x08040000
F103Z.menu.startadr.F08040000.upload.vect=0x08040000

F103Z.menu.startadr.F08050000=flash 5:0x08050000(64k)
F103Z.menu.startadr.F08050000.upload.maximum_size=65536
F103Z.menu.startadr.F08050000.upload.maximum_data_size=65536
F103Z.menu.startadr.F08050000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x50000
F103Z.menu.startadr.F08050000.build.ldscript=ld/f103xE_0805.ld
F103Z.menu.startadr.F08050000.upload.uploadadr=0x08050000
F103Z.menu.startadr.F08050000.upload.vect=0x08050000

