tony-cloud/STM32_duino/boards.txt
#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F407xG.menu.upload_method.jLinkMethod=JLink
F407xG.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407xG.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407xG.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.upload_method.STLinkMethod=STLink
F407xG.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407xG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407xG.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407xG.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
F407xG.menu.upload_method.MassStorageMethod.upload.protocol=
F407xG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F407xG.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
F407xG.menu.upload_method.serialMethod.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod.upload.altID=UNUSED
F407xG.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F407xG.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod2.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod2.upload.altID=CH340
F407xG.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F407xG.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F407xG.menu.upload_method.serialMethod1.upload.tool=serial_upload
F407xG.menu.upload_method.serialMethod1.upload.altID=PL2303
F407xG.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F407xG.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F407xG.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F407xG.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F407xG.menu.usb.Disabled=Disabled USB
F407xG.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407xG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407xG.menu.usb.SerialMSC=Mass storage
F407xG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407xG.menu.usb.Composite=Composite[CDC+MSC]
F407xG.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407xG.menu.serial.SerialUART1=SerialUART1
F407xG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407xG.menu.serial.SerialUART2=SerialUART2
F407xG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407xG.menu.serial.SerialUART3=SerialUART3
F407xG.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407xG.menu.serial.SerialUSB=SerialUSB
F407xG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
#F407xG.menu.serial.Automatic=Automatically selected based on upload method

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
F407xG.menu.log.default=Release(no-exceptions)
F407xG.menu.log.default.build.log_level=-fno-exceptions
F407xG.menu.log.Release=Release(exceptions)
F407xG.menu.log.fatal=FATAL
F407xG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F407xG.menu.log.error=ERROR
F407xG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F407xG.menu.log.warning=WARNING
F407xG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F407xG.menu.log.info=INFO
F407xG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F407xG.menu.log.debug=DEBUG
F407xG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F407xG.menu.log.trace=TRACE
F407xG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

################################### F429/Z/I #############################################
f429xG.name=F429xG(180M)

f429xG.vid.0=0x1a86
f429xG.pid.0=0x7523

f429xG.vid.1=0x1366
f429xG.pid.1=0x0105

f429xG.serial.disableDTR=true
f429xG.serial.disableRTS=true
f429xG.upload.uploadadr=0x08000000
f429xG.upload.vect=0x08000000

f429xG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
f429xG.build.core=arduino
f429xG.build.board=IGT6CORE
f429xG.build.series=STM32F4
f429xG.build.f_cpu=180000000L

f429xG.menu.subboard.IGT6_CORE=F429IG_CORE[GREEN]
f429xG.menu.subboard.IGT6_CORE.upload.maximum_size=1232896
f429xG.menu.subboard.IGT6_CORE.upload.maximum_data_size=131072
f429xG.menu.subboard.IGT6_CORE.build.variant=F429IG_CORE
f429xG.menu.subboard.IGT6_CORE.build.board=IGT6CORE
f429xG.menu.subboard.IGT6_CORE.build.extra_flags0=-DSTM32F429IG -DHSE_VALUE=8000000
f429xG.menu.subboard.IGT6_CORE.build.ldscript_pre=ld/f429xG
f429xG.menu.subboard.IGT6_CORE.upload.device=STM32F429IG
#default upload method
f429xG.menu.subboard.IGT6_CORE.upload.protocol=STLink
f429xG.menu.subboard.IGT6_CORE.upload.tool=stlink_upload
f429xG.menu.subboard.IGT6_CORE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

f429xG.menu.startadr.default=flash(1024k+128k)
f429xG.menu.startadr.default.build.extra_flags={build.extra_flags0}

f429xG.menu.startadr.F08020000=flash 1:0x08020000(128k)
f429xG.menu.startadr.F08020000.upload.maximum_size=131072
f429xG.menu.startadr.F08020000.upload.maximum_data_size=131072
f429xG.menu.startadr.F08020000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x20000
f429xG.menu.startadr.F08020000.build.ldscript={build.ldscript_pre}_0802.ld
f429xG.menu.startadr.F08020000.upload.uploadadr=0x08020000
f429xG.menu.startadr.F08020000.upload.vect=0x08020000

f429xG.menu.startadr.F08040000=flash 2:0x08040000(128k)
f429xG.menu.startadr.F08040000.upload.maximum_size=131072
f429xG.menu.startadr.F08040000.upload.maximum_data_size=131072
f429xG.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
f429xG.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
f429xG.menu.startadr.F08040000.upload.uploadadr=0x08040000
f429xG.menu.startadr.F08040000.upload.vect=0x08040000

f429xG.menu.startadr.F08060000=flash 3:0x08060000(128k)
f429xG.menu.startadr.F08060000.upload.maximum_size=131072
f429xG.menu.startadr.F08060000.upload.maximum_data_size=131072
f429xG.menu.startadr.F08060000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x60000
f429xG.menu.startadr.F08060000.build.ldscript={build.ldscript_pre}_0806.ld
f429xG.menu.startadr.F08060000.upload.uploadadr=0x08060000
f429xG.menu.startadr.F08060000.upload.vect=0x08060000

