tony-cloud/STM32_duino/boards.txt
f429xG.menu.startadr.F08080000=flash 4:0x08080000(128k)
f429xG.menu.startadr.F08080000.upload.maximum_size=131072
f429xG.menu.startadr.F08080000.upload.maximum_data_size=131072
f429xG.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
f429xG.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
f429xG.menu.startadr.F08080000.upload.uploadadr=0x08080000
f429xG.menu.startadr.F08080000.upload.vect=0x08080000

f429xG.menu.startadr.F080A0000=flash 5:0x080A0000(128k)
f429xG.menu.startadr.F080A0000.upload.maximum_size=131072
f429xG.menu.startadr.F080A0000.upload.maximum_data_size=131072
f429xG.menu.startadr.F080A0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xA0000
f429xG.menu.startadr.F080A0000.build.ldscript={build.ldscript_pre}_080A.ld
f429xG.menu.startadr.F080A0000.upload.uploadadr=0x080A0000
f429xG.menu.startadr.F080A0000.upload.vect=0x080A0000

f429xG.menu.startadr.F080C0000=flash 6:0x080C0000(128k)
f429xG.menu.startadr.F080C0000.upload.maximum_size=131072
f429xG.menu.startadr.F080C0000.upload.maximum_data_size=131072
f429xG.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
f429xG.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
f429xG.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
f429xG.menu.startadr.F080C0000.upload.vect=0x080C0000

f429xG.menu.startadr.F080E0000=flash 7:0x080E0000(128k)
f429xG.menu.startadr.F080E0000.upload.maximum_size=131072
f429xG.menu.startadr.F080E0000.upload.maximum_data_size=131072
f429xG.menu.startadr.F080E0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xE0000
f429xG.menu.startadr.F080E0000.build.ldscript={build.ldscript_pre}_080E.ld
f429xG.menu.startadr.F080E0000.upload.uploadadr=0x080E0000
f429xG.menu.startadr.F080E0000.upload.vect=0x080E0000

f429xG.menu.startadr.F08000000=flash(WithRamBoot 32kRAM used Only)
f429xG.menu.startadr.F08000000.upload.maximum_size=131072
f429xG.menu.startadr.F08000000.upload.maximum_data_size=32768
f429xG.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
f429xG.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
f429xG.menu.startadr.F08000000.upload.uploadadr=0x08000000
f429xG.menu.startadr.F08000000.upload.vect=0x08000000

f429xG.menu.startadr.R20000000=Sram 0:0x20000000(96K+32K BOOT=11 St/Jlink uploader only)
f429xG.menu.startadr.R20000000.upload.maximum_size=98304
f429xG.menu.startadr.R20000000.upload.maximum_data_size=32768
f429xG.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
f429xG.menu.startadr.R20000000.build.ldscript={build.ldscript_pre}_RAM0.ld
f429xG.menu.startadr.R20000000.upload.uploadadr=0x20000000
f429xG.menu.startadr.R20000000.upload.vect=0x20000000

f429xG.menu.extern_lib.NONE=NONE
f429xG.menu.extern_lib.STemWin=STemWin
f429xG.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_GCC.a
f429xG.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
f429xG.menu.extern_lib.STemWinOS=STemWin_OS
f429xG.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM4_OS_GCC.a
f429xG.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
f429xG.menu.upload_method.STLinkMethod=STLink
f429xG.menu.upload_method.STLinkMethod.upload.protocol=STLink
f429xG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
f429xG.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

f429xG.menu.upload_method.jLinkMethod=JLink
f429xG.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
f429xG.menu.upload_method.jLinkMethod.upload.protocol=jlink
f429xG.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

f429xG.menu.upload_method.MassStorageMethod=MassStorage [STLINK V2.1]
f429xG.menu.upload_method.MassStorageMethod.upload.protocol=
f429xG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

f429xG.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1]
f429xG.menu.upload_method.serialMethod.upload.protocol=maple_serial
f429xG.menu.upload_method.serialMethod.upload.tool=serial_upload
f429xG.menu.upload_method.serialMethod.upload.altID=UNUSED
f429xG.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

f429xG.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
f429xG.menu.upload_method.serialMethod2.upload.protocol=maple_serial
f429xG.menu.upload_method.serialMethod2.upload.tool=serial_upload
f429xG.menu.upload_method.serialMethod2.upload.altID=CH340
f429xG.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

f429xG.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
f429xG.menu.upload_method.serialMethod1.upload.protocol=maple_serial
f429xG.menu.upload_method.serialMethod1.upload.tool=serial_upload
f429xG.menu.upload_method.serialMethod1.upload.altID=PL2303
f429xG.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

f429xG.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
f429xG.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
f429xG.menu.upload_method.BMPMethod.upload.tool=bmp_upload

f429xG.menu.usb.Disabled=Disabled USB
f429xG.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
f429xG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
f429xG.menu.usb.SerialMSC=Mass storage
f429xG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
f429xG.menu.usb.Composite=Composite[CDC+MSC]
f429xG.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

f429xG.menu.serial.SerialUART1=SerialUART1
f429xG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
f429xG.menu.serial.SerialUART2=SerialUART2
f429xG.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
f429xG.menu.serial.SerialUART3=SerialUART3
f429xG.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
f429xG.menu.serial.SerialUSB=SerialUSB
f429xG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
#f429xG.menu.serial.Automatic=Automatically selected based on upload method

