tony-cloud/STM32_duino/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
f429xG.menu.log.default=Release(no-exceptions)
f429xG.menu.log.default.build.log_level=-fno-exceptions
f429xG.menu.log.Release=Release(exceptions)
f429xG.menu.log.fatal=FATAL
f429xG.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
f429xG.menu.log.error=ERROR
f429xG.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
f429xG.menu.log.warning=WARNING
f429xG.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
f429xG.menu.log.info=INFO
f429xG.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
f429xG.menu.log.debug=DEBUG
f429xG.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
f429xG.menu.log.trace=TRACE
f429xG.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### F746S ##########################################
# Discovery F746IG board
F746S.name=F746x(216M)
F746S.vid.1=0x10C4
F746S.pid.1=0xEA60

F746S.serial.disableDTR=true
F746S.serial.disableRTS=true
F746S.upload.maximum_size=1048576
F746S.upload.maximum_data_size=327680
F746S.upload.uploadadr=0x08000000
F746S.upload.vect=0x08000000

F746S.build.core=arduino
F746S.build.board=WAVESHARE_F746IG

F746S.build.mcu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-sp-d16 
F746S.build.series=STM32F7
F746S.build.variant=WAVESHARE_F746IG
F746S.build.extra_flags0=-DSTM32F746IG -DHSE_VALUE=((uint32_t)8000000)
F746S.build.f_cpu=216000000L

F746S.menu.subboard.F746IG=WaveShare F746IG
F746S.menu.subboard.F746IG.build.ldscript_pre=ld/f746xG

F746S.menu.startadr.default=flash(1024k+320k)
F746S.menu.startadr.default.build.extra_flags={build.extra_flags0}

F746S.menu.startadr.F08040000=flash 1:0x08040000(256k)
F746S.menu.startadr.F08040000.upload.maximum_size=262144
F746S.menu.startadr.F08040000.upload.maximum_data_size=327680
F746S.menu.startadr.F08040000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x40000
F746S.menu.startadr.F08040000.build.ldscript={build.ldscript_pre}_0804.ld
F746S.menu.startadr.F08040000.upload.uploadadr=0x08040000
F746S.menu.startadr.F08040000.upload.vect=0x08040000

F746S.menu.startadr.F08080000=flash 2:0x08080000(256k)
F746S.menu.startadr.F08080000.upload.maximum_size=262144
F746S.menu.startadr.F08080000.upload.maximum_data_size=327680
F746S.menu.startadr.F08080000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x80000
F746S.menu.startadr.F08080000.build.ldscript={build.ldscript_pre}_0808.ld
F746S.menu.startadr.F08080000.upload.uploadadr=0x08080000
F746S.menu.startadr.F08080000.upload.vect=0x08080000

F746S.menu.startadr.F080C0000=flash 3:0x080C0000(256k)
F746S.menu.startadr.F080C0000.upload.maximum_size=262144
F746S.menu.startadr.F080C0000.upload.maximum_data_size=327680
F746S.menu.startadr.F080C0000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0xC0000
F746S.menu.startadr.F080C0000.build.ldscript={build.ldscript_pre}_080C.ld
F746S.menu.startadr.F080C0000.upload.uploadadr=0x080C0000
F746S.menu.startadr.F080C0000.upload.vect=0x080C0000

F746S.menu.startadr.F08000000=flash(WithRamBoot used 128kRAM Only)
F746S.menu.startadr.F08000000.upload.maximum_size=262144
F746S.menu.startadr.F08000000.upload.maximum_data_size=131072
F746S.menu.startadr.F08000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
F746S.menu.startadr.F08000000.build.ldscript={build.ldscript_pre}_0800.ld
F746S.menu.startadr.F08000000.upload.uploadadr=0x08000000
F746S.menu.startadr.F08000000.upload.vect=0x08000000

F746S.menu.startadr.R20000000=Sram 0:0x20000000(192K+128K BOOT=11 ST/Jlink uploader only)
F746S.menu.startadr.R20000000.upload.maximum_size=196608
F746S.menu.startadr.R20000000.upload.maximum_data_size=131072
F746S.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F746S.menu.startadr.R20000000.build.ldscript=ld/f746xG_RAM0.ld
F746S.menu.startadr.R20000000.upload.uploadadr=0x20000000
F746S.menu.startadr.R20000000.upload.vect=0x20000000

F746S.menu.usb.Disabled=Disabled USB
F746S.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F746S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F746S.menu.usb.SerialMSC=Mass storage
F746S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F746S.menu.usb.Composite=Composite[CDC+MSC]
F746S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F746S.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PA9/PA10]
F746S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F746S.menu.serial.SerialUSB=SerialUSB
F746S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

#-------------------------------------- UPLOAD METHODS ----------------------------------------#
F746S.menu.upload_method.STLinkMethod=STLink
F746S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F746S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

F746S.menu.upload_method.jLinkMethod=JLink
F746S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F746S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F746S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F746S.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F746S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F746S.menu.upload_method.serialMethod.upload.tool=serial_upload
F746S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F746S.menu.log.default=Release(no-exceptions)
F746S.menu.log.default.build.log_level=-fno-exceptions
F746S.menu.log.Release=Release(exceptions)
F746S.menu.log.fatal=FATAL
F746S.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
F746S.menu.log.error=ERROR
F746S.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
F746S.menu.log.warning=WARNING
F746S.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
F746S.menu.log.info=INFO
F746S.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
F746S.menu.log.debug=DEBUG
F746S.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
F746S.menu.log.trace=TRACE
F746S.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

###################################### end ##########################################
